* newgl

** About
New OpenGL wrapper library.

** Examples
#+BEGIN_SRC lisp
(ql:quickload :newgl)
(newgl:viewer :objects
              (newgl:make-mandelbrot :window (make-instance 'newgl:complex-window
                                                            :imag-min -0.4284997f0
                                                            :imag-max -0.42617327f0
                                                            :real-min -1.2854176f0
                                                            :real-max -1.2827007f0)))
(newgl:viewer :objects (newgl:make-mandelbrot :window #(-1.0f0 1.0f0 0.0f0 -0.5365814f0 -0.66618943f0
                                                        -1.0f0 -1.0f0 0.0f0 -0.5365814f0 -0.6661973f0
                                                         1.0f0 1.0f0 0.0f0 -0.5365724f0 -0.66618943f0
                                                         1.0f0 -1.0f0 0.0f0 -0.5365724f0 -0.6661973f0)))

(newgl:viewer :objects (newgl:make-mandelbrot :window #(-1.0f0 1.0f0 0.0f0 -1.1581888f0 -0.30270645f0
                                                        -1.0f0 -1.0f0 0.0f0 -1.1581888f0 -0.3111232f0
                                                         1.0f0 1.0f0 0.0f0 -1.1485512f0 -0.30270645f0
                                                         1.0f0 -1.0f0 0.0f0 -1.1485512f0 -0.3111232f0)))

(newgl:viewer :objects (newgl:make-mandelbrot :window #(-1.0f0 1.0f0 0.0f0 -1.1742291f0 -0.23033905f0
                                                        -1.0f0 -1.0f0 0.0f0 -1.1742291f0 -0.2305259f0
                                                         1.0f0 1.0f0 0.0f0 -1.1740147f0 -0.23033905f0
                                                         1.0f0 -1.0f0 0.0f0 -1.1740147f0 -0.2305259f0)))

(newgl:viewer :objects (newgl:make-mandelbrot :window #(-1.0f0 1.0f0 0.0f0 -0.5717396f0 0.56185037f0
                                                        -1.0f0 -1.0f0 0.0f0 -0.5717396f0 0.5618009f0
                                                         1.0f0 1.0f0 0.0f0 -0.5716815f0 0.56185037f0
                                                         1.0f0 -1.0f0 0.0f0 -0.5716815f0 0.5618009f0)))

(newgl:viewer :objects (newgl:make-mandelbrot :window #(-1.0f0 1.0f0 0.0f0 -0.57171535f0 0.5618296f0
                                                        -1.0f0 -1.0f0 0.0f0 -0.57171535f0 0.56182176f0
                                                         1.0f0 1.0f0 0.0f0 -0.57170606f0 0.5618296f0
                                                         1.0f0 -1.0f0 0.0f0 -0.57170606f0 0.56182176f0)))

(newgl:viewer :objects (newgl:make-mandelbrot :window #(-1.0f0 1.0f0 0.0f0 -0.019941114f0 -0.80132824f0
                                                        -1.0f0 -1.0f0 0.0f0 -0.019941114f0 -0.8014834f0
                                                         1.0f0 1.0f0 0.0f0 -0.019766055f0 -0.80132824f0
                                                         1.0f0 -1.0f0 0.0f0 -0.019766055f0 -0.8014834f0)))

(newgl:viewer :objects (newgl:make-mandelbrot :window #(-1.0f0 1.0f0 0.0f0 -0.7463853f0 0.11142462f0
                                                        -1.0f0 -1.0f0 0.0f0 -0.7463853f0 0.111105055f0
                                                         1.0f0 1.0f0 0.0f0 -0.74601483f0 0.11142462f0
                                                         1.0f0 -1.0f0 0.0f0 -0.74601483f0 0.111105055f0)))

(newgl:viewer :objects (newgl:make-mandelbrot :window #(-1.0f0 1.0f0 0.0f0 -0.5890263f0 -0.658861f0
                                                        -1.0f0 -1.0f0 0.0f0 -0.5890263f0 -0.6588699f0
                                                         1.0f0 1.0f0 0.0f0 -0.5890159f0 -0.658861f0
                                                         1.0f0 -1.0f0 0.0f0 -0.5890159f0 -0.6588699f0)))
(newgl:viewer :objects (newgl:make-mandelbrot :window #(-1.0f0 1.0f0 0.0f0
                                                        -0.74516207f0
                                                        0.11257817f0 -1.0f0
                                                        -1.0f0 0.0f0
                                                        -0.74516207f0
                                                        0.11257163f0 1.0f0
                                                        1.0f0 0.0f0
                                                        -0.7451545f0
                                                        0.11257817f0 1.0f0
                                                        -1.0f0 0.0f0
                                                        -0.7451545f0
                                                        0.11257163f0)))
(newgl:viewer :objects (newgl:make-mandelbrot :window #(-1.0f0 1.0f0 0.0f0
                                                        -0.7574141f0
                                                        0.065616846f0 -1.0f0
                                                        -1.0f0 0.0f0
                                                        -0.7574141f0
                                                        0.065610915f0 1.0f0
                                                        1.0f0 0.0f0
                                                        -0.7574074f0
                                                        0.065616846f0 1.0f0
                                                        -1.0f0 0.0f0
                                                        -0.7574074f0
                                                        0.065610915f0)))
(newgl:viewer :objects (newgl:make-mandelbrot :window #(-1.0f0 1.0f0 0.0f0
                                                        -0.7915367f0
                                                        0.14473091f0 -1.0f0
                                                        -1.0f0 0.0f0
                                                        -0.7915367f0
                                                        0.14472453f0 1.0f0
                                                        1.0f0 0.0f0
                                                        -0.7915295f0
                                                        0.14473091f0 1.0f0
                                                        -1.0f0 0.0f0
                                                        -0.7915295f0
                                                        0.14472453f0)))
(newgl:viewer :objects (newgl:make-mandelbrot :window #(-1.0f0 1.0f0 0.0f0
                                                        -1.2241297f0
                                                        0.17696597f0 -1.0f0
                                                        -1.0f0 0.0f0
                                                        -1.2241297f0
                                                        0.17690969f0 1.0f0
                                                        1.0f0 0.0f0
                                                        -1.2240658f0
                                                        0.17696597f0 1.0f0
                                                        -1.0f0 0.0f0
                                                        -1.2240658f0
                                                        0.17690969f0)))
(newgl:viewer :objects (newgl:make-mandelbrot :window #(-1.0f0 1.0f0 0.0f0
                                                        -0.7560801f0
                                                        0.067180365f0 -1.0f0
                                                        -1.0f0 0.0f0
                                                        -0.7560801f0
                                                        0.067152254f0 1.0f0
                                                        1.0f0 0.0f0 -0.756049f0
                                                        0.067180365f0 1.0f0
                                                        -1.0f0 0.0f0
                                                        -0.756049f0
                                                        0.067152254f0)))
(newgl:viewer :objects (newgl:make-mandelbrot :window #(-1.0f0 1.0f0 0.0f0
                                                        -0.7561429f0
                                                        0.06667288f0 -1.0f0
                                                        -1.0f0 0.0f0
                                                        -0.7561429f0
                                                        0.06666395f0 1.0f0
                                                        1.0f0 0.0f0
                                                        -0.7561331f0
                                                        0.06667288f0 1.0f0
                                                        -1.0f0 0.0f0
                                                        -0.7561331f0
                                                        0.06666395f0)))
(newgl:viewer :objects (newgl:make-mandelbrot :window #(-1.0f0 1.0f0 0.0f0
                                                        -1.2487084f0
                                                        -0.15175077f0 -1.0f0
                                                        -1.0f0 0.0f0
                                                        -1.2487084f0
                                                        -0.15202482f0 1.0f0
                                                        1.0f0 0.0f0
                                                        -1.2483872f0
                                                        -0.15175077f0 1.0f0
                                                        -1.0f0 0.0f0
                                                        -1.2483872f0
                                                        -0.15202482f0)))
(newgl:viewer :objects (newgl:make-mandelbrot :window #(-1.0f0 1.0f0 0.0f0
                                                        0.3738236f0
                                                        -0.13247809f0 -1.0f0
                                                        -1.0f0 0.0f0
                                                        0.3738236f0
                                                        -0.13253279f0 1.0f0
                                                        1.0f0 0.0f0 0.373886f0
                                                        -0.13247809f0 1.0f0
                                                        -1.0f0 0.0f0 0.373886f0
                                                        -0.13253279f0)))

(newgl:viewer :objects (newgl:make-mandelbrot :window #(-1.0f0 1.0f0 0.0f0
                                                        0.33340436f0
                                                        -0.26062173f0 -1.0f0
                                                        -1.0f0 0.0f0
                                                        0.33340436f0
                                                        -0.48583227f0 1.0f0
                                                        1.0f0 0.0f0
                                                        0.59035236f0
                                                        -0.26062173f0 1.0f0
                                                        -1.0f0 0.0f0
                                                        0.59035236f0
                                                        -0.48583227f0)))
#+END_SRC

#+RESULTS:
: #<SIMPLE-TASKS:CALL-TASK :FUNC #<CLOSURE (LAMBDA () :IN NEWGL:VIEWER) {100E239C9B}> :STATUS :SCHEDULED {100E239D03}>


** License
ISC


Copyright (c) 2019 Jeremiah LaRocco <jeremiah_larocco@fastmail.com>



* Plan
** TODO Fill in a TODO list.
